www/holy/lisp-in-real-world.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge83e0ab">Lisp в реальном мире</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge83e0ab" class="outline-2">
<h2 id="orge83e0ab">Lisp в реальном мире</h2>
<div class="outline-text-2" id="text-orge83e0ab">
<p>
Оригинал: <a href="https://stackoverflow.com/questions/172798/lisp-in-the-real-world">https://stackoverflow.com/questions/172798/lisp-in-the-real-world</a>
</p>

<p>
Я экспериментировал с Lisp (фактически Scheme) и нашел, что это очень красивый язык,
который мне интересен, чтобы узнать больше. Тем не менее, похоже, что Lisp никогда не
используется в серьезных проектах, и я не видел, чтобы он был указан как желаемый навык
при любой публикации вакансий. Мне интересно услышать от любого, кто использовал Lisp,
или видел, как он использовался в "реальном мире", или кто знает, считается ли он чисто
академическим языком.
</p>

<p>
<b>Matthias Benkard</b>:
</p>

<p>
<code>Franz, Inc.</code> представляет <a href="https://franz.com/success/all_customer_apps.lhtml">неисчерпаемый список на своем веб-сайте</a>:
</p>

<p>
"Пожалуйста, не принимайте Lisp за язык, полезный только для анимации и графики, AI,
Биоинформатики, B2B и электронной коммерции, Data Mining, EDA/Semiconductor приложений,
экспертных систем, финансов, интеллектуальных агентов, управления знаниями,
Механических CAD, моделирования, обработки естественного языка, Оптимизации,
исследований, анализа рисков, планирования, телекоммуникаций и веб-авторинга просто
потому, что это единственные вещи и они оказались в списке&#x2026;"
</p>

<p>
Кент Питман, Computer Scientist, President of HyperMeta, Inc.
(<a href="https://en.wikipedia.org/wiki/Kent_Pitman">https://en.wikipedia.org/wiki/Kent_Pitman</a>)
</p>

<p>
<b>Joe Shaw</b>:
</p>

<p>
<a href="http://itasoftware.com/">ITA Software</a> использует Common Lisp для своей поисковой системы с низким уровнем
тарифов <code>QPX</code>, которая поддерживает такие сайты, как
</p>
<ul class="org-ul">
<li>Orbitz <a href="https://orbitz.com/">https://orbitz.com/</a></li>
<li>Kayak <a href="https://kayak.com">https://kayak.com</a></li>
<li>American Airlines <a href="https://aa.com">https://aa.com</a></li>
<li>United <a href="https://united.com">https://united.com</a></li>
</ul>
<p>
и многие других.
</p>

<p>
Он также частично использовался для системы бронирования пассажиров для Air Canada. Пол
Грэм написал немного о Lisp в ITA в прошлом: <a href="http://www.paulgraham.com/carl.html">Carl de Marcken: Inside Orbitz</a>
</p>

<p>
(Отказ от ответственности: я там работаю.)
</p>

<p>
<b>Attila Lendvai</b>:
</p>

<p>
В качестве небольшого проекта мы создали то, что некоторые люди называют "сервером
приложений". но на самом деле это всего лишь совокупность интегрированных общих
библиотек lisp для подключения и веб-приложений. некоторые детали доступны на странице
<a href="http://common-lisp.net/project/cl-dwim">cl-dwim</a>
</p>

<p>
Используя то, что мы разработали, мы сделали веб-приложение для венгерского
правительства, которое собирает данные от локальных органов власти и рассчитывает
соответствующую часть бюджета страны. Это второй бюджет, который мы планируем сейчас
(06 окт 2008).
</p>

<p>
У него около 4000 пользователей, и он работает на кластере компьютеров.
</p>

<p>
Как "академический язык" мы играем с такими вещами, как <code>persistent continuations</code> для
моделирования бизнес-процессов. Это некоторый случайный lisp-код с несколькими
дополнительными примитивами, связанными с процессом, и несколькими ограничениями. Он
может останавливаться в случайных точках и засыпать (например, когда коммитит в базу
данных), пока он ждет какого-либо внешнего события.
</p>

<p>
Это практический или академический? вам решать :)
</p>

<p>
<b>Mark Reid</b>:
</p>

<p>
<a href="http://reddit.com/">Reddit</a> изначально был записан на Lisp, а затем переписан на Python. Там хороший анализ
что это означает для Lisp в <a href="http://www.findinglisp.com/blog/2005/12/reddit-and-lisp-psychosis.html">Поиск Lisp</a>.
</p>

<p>
<b>jfs</b>:
</p>

<p>
<a href="http://www.flownet.com/gat/jpl-lisp.html">История подъема и падения Lisp в Лаборатории реактивного движения</a>
</p>

<p>
<b>epatel</b>:
</p>

<p>
Пол Грэм использовал и написал о ViaWeb, который был написан в LISP
</p>

<p>
Прочитайте об этом здесь - <a href="http://paulgraham.com/avg.html">Побеждая посредственность</a>
</p>

<p>
<b>Galghamon</b>:
</p>

<p>
Довольно недавний проект с открытым исходным кодом, который по-прежнему пользуется
последовательной и значительной активностью развития, <a href="http://lilypond.org/web/">LilyPond</a>.
</p>

<p>
Это программа нотной записи, в которую вводят простой для записи текстовый файл и
преобразует его в красивые ноты (в pdf). Предлагает всевозможные способы возиться с
выходным форматом, если хотите. Он может даже создавать достойные звучащие
MIDI-файлы. Я использую его всякий раз, когда мне нужно создавать хорошие ноты, которые
будут читать другие музыканты. Я думаю, что это лучше, чем <code>Finale</code>, и это бесплатно!
</p>

<p>
В коммерческой категории есть также <a href="http://www.noteheads.com/default.asp">Notehead's Igor Engraver</a>. К сожалению, сайт не
позволяет мне публиковать прямую ссылку на страницу, где говорится о Lisp, поэтому
перейдите к Downloads и посмотрите внизу на ссылку "Lisp".
</p>

<p>
Там также <code>Naughty Dog</code> (компания компьютерных игр), которые используют Lisp в своих
играх. <a href="http://grammerjack.spaces.live.com/blog/cns!F2629C772A178A7C!135.entry">Эта статья</a> говорит об этом и даже показывает некоторый код.
</p>

<p>
И есть много других, о которых упоминалось и связано, но это основные, которые
резонируют со мной (будучи композитором/программистом/игроком/&#x2026;).
</p>

<p>
В качестве схемера мне было интересно прочитать часть руководства <code>LilyPond</code>, в котором
объясняется, как Scheme стала частью <code>LilyPond</code>. Он был полностью на C, но они
обнаружили, что пользователь должен быть более "programmable" пользователем, и они
смогли решить эту проблему, переписав части его в Scheme и построив интерпретатор
Scheme, который дает пользователю доступ к внутренностям <code>LilyPond</code> .
</p>

<p>
<b>skypher</b>:
</p>

<p>
Некоторые более свежие:
</p>
<ul class="org-ul">
<li>Thanandar, немецкая браузерная игра: <a href="http://www.thanandar.de/">http://www.thanandar.de/</a></li>
<li>Aula Polska, польское сообщество предпринимателей: <a href="http://www.aulapolska.pl/">http://www.aulapolska.pl/</a></li>
<li>LAMsight, приложение для медицинской съемки: <a href="https://www.lamsight.org/">https://www.lamsight.org/</a></li>
<li>Wigflip, игровая площадка глупых gfx: <a href="http://wigflip.com/">http://wigflip.com/</a>:)</li>
<li>Clutu, многопользовательские AJAX кроссворды: <a href="http://www.clutu.com/">http://www.clutu.com/</a></li>
</ul>

<p>
Первые три из них были написаны с использованием Weblocks, CL web framework. Wigflip и
Clutu используют чистый Hunchentoot.
</p>


<p>
<b>Eric Normand</b>:
</p>

<p>
Питер Кристенсен составил отличный список (финансово) успешных компаний lisp.
<a href="http://www.pchristensen.com/blog/lisp-companies/">http://www.pchristensen.com/blog/lisp-companies/</a>
</p>

<p>
<b>Rich</b>:
</p>

<p>
Есть много компаний, проектов и продуктов, которые используют Lisp в различных ролях -
я сделал работу для нескольких из них.
</p>

<p>
Есть два важных момента:
</p>

<p>
вы, возможно, никогда не узнаете, что ваш последний кусок бытовой электроники был
встроен или даже запрограммирован в Common Lisp или что какая-то используемая вами
услуга работает на сервере Lisp. Было бы неверно заключить, что Lisp "никогда не
используется".
</p>

<p>
&#x2026; и, как и многие домены, эти задания никогда не появлялись на Monster.com. Просто
потому, что вы никогда не видели, чтобы объявление о вакансиях для него не означало,
что нет возможностей Lisp-required или right-tool-for-the-job.
</p>

<p>
<b>Tikhon Jelvis</b>:
</p>

<p>
Система плагинов GIMP основана на схеме. Я не знаю, является ли это полностью "реальным
миром", но, по-видимому, это практическое применение Lisp.
</p>

<p>
<b>ThePrisoner</b>:
</p>

<p>
Космический телескоп Хаббла запланирован с использованием инструментов планирования
Lisp. "Шаттл" был тоже. Телескоп Webb будет. Компания, для которую я пишу на Lisp,
анализирует миллиарды долларов страховых полисов и растет на ~ 30% в год даже через
рецессию. Мы были приобретены огромной компанией, и один из наших программистов сравнил
(фактически улучшил) выпуск ПО огромной компании для анализа заявок Medicare, начиная с
нуля, сам по себе, через год. Огромная компания делала ту же работу 6 лет и силами
нескольких программистов. Беда в том, что слишком много людей слушают болтовню о
"множестве раздражающих глупых круглых скобок" и т.д. Большинство менеджеров не "секут"
и предпочли бы иметь проект на достаточно знакомом языке, чтобы управлять методами
микроменеджмента. Они думают "Lisp=AI" и даже не хотят рассматривать возможность того,
что это хороший язык общего назначения. Они просто затыкают уши. Есть не отшлифованные
инструменты для создания сайтов с поддержкой M$, а также для кластеризации или
конвейерной обработки существующих приложений Java, и что 90% того, что волнует
ИТ-компанию сегодня - это рост путем поглощения. Я мог бы продолжать, но это только бы
меня огорчило. :)
</p>

<p>
<b>BCS</b>:
</p>

<p>
Посмотрите <a href="http://www.cs.utexas.edu/users/moore/acl2/">ACL2</a>. Это формальный логический движок на основе lisp, который использовался
для ряда проектов "реального мира", таких как формальные методы в области обеспечения
безопасности программного обеспечения и доказательств правильности для аппаратных
средств с плавающей точкой.
</p>

<p>
<b>Curtis</b>:
</p>

<p>
Lisp используется в реальной алгоритмической музыкальной композиции с библиотекой
<a href="http://commonmusic.sourceforge.net/">Common Music</a>. Заметки Рика Таубе из Metalevel - отличный вводный текст для темы,
которая содержит кучу примеров в Lisp для составления. См. Каталог примеров <a href="http://www.moz.ac.at/sem/lehre/lib/cm/Notes%20from%20the%20Metalevel/00/contents.html">здесь</a> и
копию текста <a href="http://lit.gfax.ch/MusicProgrammingUsingLisp.pdf">здесь</a>.
</p>

<p>
<b>dmitry＿vk</b>:
</p>

<p>
Я был очень впечатлен, когда узнал, что PRISM ("Проект Prism - это долгосрочный проект
по созданию программных инструментов для планирования лучевой терапии, включая
инструменты искусственного интеллекта, а также системы ручного моделирования") написан
на Common Lisp.
</p>

<p>
На моей работе я пишу программное обеспечение, которое использует DICOM, и я должен
сказать, что написать хорошую реализацию DICOM - трудная задача. В своем отчете они
описывают, как Common Lisp позволяет им построить хорошую реализацию DICOM, которая
лучше (по крайней мере, в некотором роде), чем другая реализация и требует меньших
усилий.
</p>

<p>
<b>shikhar</b>:
</p>

<p>
Google App Inventor написан на схеме
</p>

<p>
<b>simon</b>:
</p>

<p>
Ну, это вряд ли имеет значение, но я использую lisp для большей части моего
исследовательского кода, которым можно управлять. Это, безусловно, лучший язык, который
я нашел для баланса динамизма и выразительности, в то же время создавая приличную
производительность для численных моделей и т.д.
</p>

<p>
<b>Jan Stolarek</b>:
</p>

<p>
Теперь я понял, что <code>Maxima</code>, программа для символической алгебры, написана в Common
Lisp. Я использую это довольно долгое время, и я думаю, что это тоже очень хороший
пример в реальной жизни.
</p>

<p>
<b>antono</b>:
</p>

<p>
<code>GNU Make</code> расширяется Scheme. Случай для программирования в реальном мире:)
<a href="https://www.gnu.org/software/make/manual/html_node/Guile-Integration.html">https://www.gnu.org/software/make/manual/html_node/Guile-Integration.html</a>
</p>

<p>
<b>soegaard</b>:
</p>

<p>
Мэтью Эрик Бассетт про использование Racket в киноиндустрии:
<a href="http://www.youtube.com/watch?v=37owCjWnkK0">http://www.youtube.com/watch?v=37owCjWnkK0</a>
</p>

<p>
Даниэль Либголд про Racket и PS3: <a href="http://www.youtube.com/watch?v=oSmqbnhHp1c">http://www.youtube.com/watch?v=oSmqbnhHp1c</a>
</p>

<p>
<b>jfs</b>:
</p>

<p>
Язык программирования Scheme используется в качестве языка сценариев с помощью FLUENT
Flow Modeling Software (вычислительная гидродинамика, CFD).
</p>

<p>
<b>Thomas Baruchel</b>:
</p>

<p>
Как уже говорилось, система компьютерной алгебры <code>Maxima</code> написана в Lisp, но другие
CAS также записаны в Lisp, например, <code>Axiom</code> и его форки (<code>OpenAxiom</code> и <code>Fricas</code>).
</p>

<p>
<b>rabidmachine</b>:
</p>

<p>
У моей компании есть программное обеспечение, написанное в Scheme (PLT). Программное
обеспечение используется для работы в качестве брандмауэра электронной почты для
крупных компаний.
</p>

<p>
Панель инструментов алгоритмической композиции от Пола Берга:
<a href="http://www.koncon.nl/downloads/ACToolbox/">http://www.koncon.nl/downloads/ACToolbox/</a>
</p>

<p>
<b>bluesixty</b>:
</p>

<p>
Я вижу, что некоторые люди уже упомянули об этом, но lisp широко используется в
пользовательской разработке Autocad. Autocad включает встроенный интерпретатор
lisp. Это один из самых простых способов расширения продукта и обеспечивает возможность
быстрого повышения производительности.
</p>

<p>
Никакая компиляция не требуется, на стороне пользователя и одна или более строк
lisp-выражения могут быть введены в командной строке и выполняться непосредственно на
чертеже. Для дизайнеров и рисовальщиков, готовых сделать небольшой шаг к изучению основ
lisp, он может обеспечить огромный выигрыш в производительности.
</p>

<p>
Autocad предоставляет ряд других способов настройки своих продуктов; ObjectARX (С++),
VB, С# и т.д. Интерфейс lisp на сегодняшний день проще всего изучить и реализовать. И
большинство других сред-разработчиков используют lisp в некотором роде.
</p>

<p>
Интерпретатор lisp был доступен в очень ранней версии Autocad и назывался переменными и
выражениями. Он был довольно ограниченным, но был настолько успешным с пользователями,
что была добавлена дополнительная функциональность. Полностью раздутый визуальный IDE
был позже (в версии 2000, я думаю).
</p>

<p>
Мне бы не хотелось догадываться, сколько миллионов (миллиардов) строк из кода lisp
доступно для Autocad. Поиск google на "autocad.lsp" возвращает 2,3 миллиона обращений.
</p>

<p>
<b>dmitryame</b>:
</p>

<p>
<a href="http://echowaves.com">http://echowaves.com</a> встроен в clojure с compojure. Сайт был создан как учебное
упражнение, чтобы увидеть, насколько практично использовать clojure для создания
веб-приложений. Ответ - да! Изучите clojure во что бы то ни стало - это улучшит вашу
карьеру. Код является открытым, если кто-то хочет увидеть пример, каковы типичные части
движка для типичного приложения <a href="https://github.com/echowaves/echowaves">https://github.com/echowaves/echowaves</a>
</p>

<p>
<b>kmmbvnr</b>:
</p>

<p>
<a href="http://www.gensym.com/">http://www.gensym.com/</a> - Real time business rules engine. Есть много промышленных
клиентов. Внутри система написана на Commom Lisp.
</p>
</div>
</div>
</div>
</body>
</html>
